labs/lab03/lab03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-06 Fri 15:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab 3: Derivations Worksheet</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../style.css" />
</head>
<body>
<div id="org-div-home-and-up">[<a href="../../index.html">back</a>]</div><div id="content" class="content">
<h1 class="title">Lab 3: Derivations Worksheet</h1>
<p>
This week you'll be given a worksheet with a couple problems to
practice writing derivations.  A secondary objective of this lab is
to emphasize that, when substituting a value into an expression, it is
implicitly <i>converted</i> back into an expression.  So, for example,
</p>

<div class="org-src-container">
<pre class="src src-txt">[λx . x / f](f y) = (fun x -&gt; x) y
</pre>
</div>

<p>
That is, the variable <code>f</code> in the expression <code>f y</code> is replaced with the
function expression <code>fun x -&gt; x</code> and not the function value <code>λ x . x</code>.
</p>

<p>
As usual, please use this opportunity to clear up any confusions you
have by asking the TF/TAs questions. They're very smart folks!
</p>
</div>
</body>
</html>
